/* Практическое задание 7.*/

/* Задание # 1.
 	 	Составьте список пользователей users, которые осуществили хотя бы один заказ
 	 	orders в интернет магазине.
*/

SELECT name AS 'Имя заказчика'
	FROM users u 
	INNER JOIN orders o ON u.id = o.user_id -- объединяем таблицы по id пользователя
	GROUP BY u.id ;							-- групперуем, что бы не было повторений 

/* 	Вместо INNER JOIN можно написать просто JOIN, но с INNER нагляднее.
	В условии ON указываем, что объединяем таблицы по ключу id пользователя.
	Если в таблице orders не будет записи, где id заказа соответсвует 
	id пользователя, значит пользователь с таким id не делал заказ и он
	не будет паказан в результате
*/