/* Практическое задание 5. «Агрегация данных»*/

/* Задание # 2.
 	Подсчитайте количество дней рождения, которые приходятся на каждый из дней недели. 
 	Следует учесть, что необходимы дни недели текущего года, а не года рождения.
*/

SELECT
	count(*) AS 'кол-во ДР', -- подсчитываем кол-во дней рождений нв день недели
	WEEKDAY(birthday_at)	 -- определяем день недели по дате
    AS week_day,			 -- задаем название промежуточного аргумента
    DAYNAME(birthday_at)	 -- определяем название деня недели по дате
    FROM users				 -- указываем таблицу исходных данных 
    group BY week_day;		 -- групперуем значения по промежуточному аргументу 							

/* часа 3 пытался объединить текущий год и месяц + дент рождения,
 * но ничего не получилось ....
 * 
SELECT concat(YEAR (CURDATE()), DATE_FORMAT(birthday_at, '%m,%d') FROM users;
 
SELECT YEAR (CURDATE());
  
SELECT * FROM users WHERE CONCAT(YEAR (CURDATE()),' ',
DATE_FORMAT(birthday_at, '%m,%d'));
*/

